#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьЭлементыНаФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	 
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппу(Форма, Форма.Элементы.ГруппаШапкаПраво); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппу(Форма, Форма.Элементы.ГруппаШапкаПраво);
    ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппу(Форма, Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоПередЭлементом(Форма, Форма.Элементы.Основание);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоПередЭлементом(Форма, Форма.Элементы.СуммаДокумента);    
	КонецЕсли;
	
КонецПроцедуры   

Процедура ДобавитьКонтактноеЛицоВГруппу(Форма, ИмяГруппы) Экспорт 
	
	НовоеПоле = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), ИмяГруппы);
    НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "Объект.Доп_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьКонтактноеЛицоПередЭлементом(Форма, ЭлементПередКоторымВставка) Экспорт 
	
	НовоеПоле = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , ЭлементПередКоторымВставка);
    НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "Объект.Доп_КонтактноеЛицо";
	
КонецПроцедуры  

#КонецОбласти